zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
<?xml version='1.0' encoding='utf-8'?>
<device schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance">
    <name>FM33A0XXX</name>
    <version>1.0</version>
    <!--initial version-->
    <description>ARM 32-bit Cortex SC000 + MPU Microcontroller based device</description>
    <cpu>
        <!-- details about the cpu embedded in the device -->
        <name>SC000</name>
        <revision>r1p0</revision>
        <endian>little</endian>
        <mpuPresent>true</mpuPresent>
        <fpuPresent>false</fpuPresent>
        <nvicPrioBits>3</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <addressUnitBits>8</addressUnitBits>
    <!-- byte addressable memory -->
    <width>32</width>
    <!-- bus width is 32 bits -->
    <resetValue>0x00000000</resetValue>
    <resetMask>0xFFFFFFFF</resetMask>
    <peripherals>
        <!--SCU-->
        <peripheral>
            <name>SCU</name>
            <description>System config unit</description>
            <groupName>SCU</groupName>
            <baseAddress>0x40000000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--SYSCON: System Config Register-->
                <register>
                    <name>SYSCON</name>
                    <description>System Config Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000180</resetValue>
                    <fields>
                        <!--MODE-->
                        <field>
                            <name>MODE</name>
                            <description>chip work mode</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>User</name>
                                    <description>user mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Manufacture</name>
                                    <description>Manufacture mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>User</name>
                                    <description>user mode</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Original</name>
                                    <description>Original mode </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FLSCFG-->
                        <field>
                            <name>FLSCFG</name>
                            <description>Flash Config</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>512KB</name>
                                    <description>Flash size is 512K</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>384KB</name>
                                    <description>Flash size is 384K</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>256KB</name>
                                    <description>Flash size is 256K</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>192KB</name>
                                    <description>Flash size is 192K</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RAMCFG-->
                        <field>
                            <name>RAMCFG</name>
                            <description>RAM Config</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>64KB</name>
                                    <description>RAM size is 64KB</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>48KB</name>
                                    <description>RAM size is 48KB</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>32KB</name>
                                    <description>RAM size is 32KB</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16KB</name>
                                    <description>RAM size is 16KB</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CRYSLESS-->
                        <field>
                            <name>CRYSLESS</name>
                            <description>CRYSLESS config</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CRYSTL</name>
                                    <description>crystal is available</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRYSLESS</name>
                                    <description>CRYSTAL and FDET is not available</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CRYSLESS_B-->
                        <field>
                            <name>CRYSLESS_B</name>
                            <description>toggle of CRYSLESS Bit</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CRYSTLESS</name>
                                    <description>crystal and FDET is not available</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRYSL</name>
                                    <description>CRYSTAL and FDET is available</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RDPROTFAIL-->
                        <field>
                            <name>RDPROTFAIL</name>
                            <description>NVR0 Validation fail</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PASS</name>
                                    <description>NVR0 Validation pass</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FAIL</name>
                                    <description>NVR0 Validation fail</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--VERIFAIL-->
                        <field>
                            <name>VERIFAIL</name>
                            <description>VERIFY FAIL</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PASS</name>
                                    <description>NVR1 verify pass</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FAIL</name>
                                    <description>NVR1 verify pass</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--DBGCFG: Debug Config Register-->
                <register>
                    <name>DBGCFG</name>
                    <description>debug congfig, only use at bebug mode </description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00003F03</resetValue>
                    <fields>
                        <!--IWDT_STOP:IWDT STOP AT DEBUG-->
                        <field>
                            <name>IWDT_STOP</name>
                            <description>SET IWDT STOP AT DEBUG</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>iwdt is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>iwdt is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WWDT_STOP: WWDT STOP AT DEBUG-->
                        <field>
                            <name>WWDT_STOP</name>
                            <description>SET WWDT STOP AT DEBUG</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>wwdt is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>wwdt is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BT1_STOP: BT1 STOP AT DEBUG-->
                        <field>
                            <name>BT1_STOP</name>
                            <description>set BT1 stop at debug</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>BT1 is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>BT1 is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BT2_STOP: BT2 STOP AT DEBUG-->
                        <field>
                            <name>BT2_STOP</name>
                            <description>set BT2 stop at debug</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>BT2 is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>BT2 is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ET1_STOP: ET1 STOP AT DEBUG-->
                        <field>
                            <name>ET1_STOP</name>
                            <description>set ET1 stop at debug</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>ET1 is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>ET1 is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ET2_STOP: ET2 STOP AT DEBUG-->
                        <field>
                            <name>ET2_STOP</name>
                            <description>set ET2 stop at debug</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>ET2 is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>ET2 is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ET3_STOP: ET3 STOP AT DEBUG-->
                        <field>
                            <name>ET3_STOP</name>
                            <description>set ET3 stop at debug</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>ET3 is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>ET3 is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ET4_STOP: ET4 STOP AT DEBUG-->
                        <field>
                            <name>ET4_STOP</name>
                            <description>set ET4 stop at debug</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RUNNING</name>
                                    <description>ET4 is running</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOPPED</name>
                                    <description>ET4 is not running</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
