zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--HDFFLAG: HARD FAULT FLAG Register -->
                <register>
                    <name>HDFFLAG</name>
                    <description>Hard Fault Flag </description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!-- hdf_request_flag: any hard fault is request, write 1 to clear-->
                        <field>
                            <name>hdf_request_flag</name>
                            <description>any hard fault is request</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOREQ</name>
                                    <description>no hard fault is rquested</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REQ</name>
                                    <description>some hard fault is requested</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--special_op_flag: special operation is implimented, write 1 to clear-->
                        <field>
                            <name>special_op_flag</name>
                            <description> special operation is implimented </description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOREQ</name>
                                    <description>no special operation fault is rquested</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REQ</name>
                                    <description>Special operation fault is rquested</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--tbit_flag: Thumb-State flag, write 1 to clear-->
                        <field>
                            <name>tbit_flag</name>
                            <description>Thumb-State flag, write 1 to clear</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Thumb-State</name>
                                    <description>at Thumb-State</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ARM_State</name>
                                    <description>At ARM state</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--bkpt_flag: BKPT operation is implimented, Write 1 to clear-->
                        <field>
                            <name>bkpt_flag</name>
                            <description>BKPT operation is implimented, Write 1 to clear</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOBKPT</name>
                                    <description>no BKPT operation is implimented</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BKPTONCE</name>
                                    <description>at least one BKPT operation is implimented</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--svcundef_flag: SVC undefined flag, write 1 to clear-->
                        <field>
                            <name>svcundef_flag</name>
                            <description> special operation is implimented </description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--dabort_resp_flag: ilegal access to some address, write 1 to clear-->
                        <field>
                            <name>dabort_resp_flag</name>
                            <description>ilegal access to some address, write 1 to clear</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>legal_access</name>
                                    <description>all access is legal address</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ilegal_access</name>
                                    <description>some access is ilegal address</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--dabort_addr_flag: access adress is not alignment,write 1 to clear-->
                        <field>
                            <name>dabort_addr_flag</name>
                            <description>access adress is not alignment,write 1 to clear</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>legal_access</name>
                                    <description>no operation is address unalignment</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ilegal_access</name>
                                    <description>some operation is address unalignment</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
