zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
            </registers>
        </peripheral>
        <!--PMU-->
        <peripheral>
            <name>PMU</name>
            <description>POWER MANAGEMENT UNIT</description>
            <groupName>PMU</groupName>
            <baseAddress>0x40000100</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--LPMCFG: Low Power Management Config Register-->
                <register>
                    <name>LPMCFG</name>
                    <description> Low Power Management Config Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00060000</resetValue>
                    <fields>
                        <!--PMOD-->
                        <field>
                            <name>PMOD</name>
                            <description>power down mode </description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Active mode</name>
                                    <description>Active mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPRUN mode</name>
                                    <description>LPRUN mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name> Sleep mode</name>
                                    <description> Sleep mode</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Stop mode</name>
                                    <description>Stop mode</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RFUI-->
                        <field>
                            <name>RFUI</name>
                            <description>RFUI</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2</name>
                                    <description>2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>3</name>
                                    <description>3</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CVS-->
                        <field>
                            <name>CVS</name>
                            <description>Core Voltage Scaling</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOScaling</name>
                                    <description>NOT Scaling at Sleep/DeepSleep/Stop mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Scaling</name>
                                    <description>Scaling to 1.2V at Sleep/DeepSleep/Stop mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SLPDP-->
                        <field>
                            <name>SLPDP</name>
                            <description>DeepSleep config</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Sleep</name>
                                    <description>Sleep mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DeepSleep</name>
                                    <description>DeepSleep mode,close vref</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DSLPRAM_EXT-->
                        <field>
                            <name>DSLPRAM_EXT</name>
                            <description>RAM status at deepsleep mode </description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Alive</name>
                                    <description>ram alive at deepsleep</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RAM_SHUTDOWN</name>
                                    <description>RAM shutdown at deepsleep</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LDO15EN_B-->
                        <field>
                            <name>LDO15EN_B</name>
                            <description>LDO15 ENABLE BIT REVERSE</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ldo15 enable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>shutdown</name>
                                    <description>ldo15 shutdown</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LDO15EN-->
                        <field>
                            <name>LDO15EN</name>
                            <description>LDO15 enable status</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>LDO15 SHUT DOWN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>LDO15 ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--XTOFFB-->
                        <field>
                            <name>XTOFFB</name>
                            <description>XTOFFB BIT REVERSE</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>XTLF CLOSE</name>
                                    <description>XTLF CLOSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XTLF ENABLE</name>
                                    <description>XTLF ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--XTOFF-->
                        <field>
                            <name>XTOFF</name>
                            <description>XTOFF BIT</description>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>XTLF ENABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>XTLF DISABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
