zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--WKDLYCON: Wakeup Delay Control Register-->
                <register>
                    <name>WKDLYCON</name>
                    <description>Wakeup Delay Control Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <!--TRHR:time of RHR-->
                        <field>
                            <name>TRHR</name>
                            <description>TIME OF RHR AT DeepSleep/Stop</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>12us</name>
                                    <description>time of RHR is 12us</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16us</name>
                                    <description>time of RHR is 16us</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>24us</name>
                                    <description>time of RHR is 24us</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>32us</name>
                                    <description>time of RHR is 32us</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--IOWKFLAG: IO Wakeup FLAG Register -->
                <register>
                    <name>IOWKFLAG</name>
                    <description>IO Wakeup FLAG Register </description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!-- WKPxF: wakeup flag of pinX-->
                        <field>
                            <name>WKPxF</name>
                            <description>wakeup flag of pinX</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DBGWKF: debug wakeup flag-->
                        <field>
                            <name>DBGWKF</name>
                            <description>debug wakeup flag,write 1 to clear</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NODBWK</name>
                                    <description>no debug wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DBWK</name>
                                    <description>debug wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--LPRIE: Low Power IE Register -->
                <register>
                    <name>LPREIE</name>
                    <description>low power IE register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LPREIE-->
                        <field>
                            <name>LPREIE</name>
                            <description>low power run error interrupt enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>Disable lprun error interrupt</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>Enable lprun error interrupt</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SLPEIE-->
                        <field>
                            <name>SLPEIE</name>
                            <description>sleep error interrupt enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>disable Sleep error interrupt</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>Enable sleep error interrupt</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--STPEIR-->
                        <field>
                            <name>STPEIR</name>
                            <description>stop error interrupt enable bit</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>disable stop error interupt</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>stop error interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
