zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--SOFTRST: SOFT reset Register-->
                <register>
                    <name>SOFTRST</name>
                    <description>soft reset Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SOFTRESET</name>
                            <description>Write softreset key word to reset CPU</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RSTFLAG:RESET FLAG Register -->
                <register>
                    <name>RSTFLAG</name>
                    <description>RESET FLAG Register </description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--NVICN_FLAG-->
                        <field>
                            <name>NVICN_FLAG</name>
                            <description>NVIC reset flag</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_NVIC</name>
                                    <description>no NVIC reset </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NVIC</name>
                                    <description>NVIC reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LKUPN_FLAG-->
                        <field>
                            <name>LKUPN_FLAG</name>
                            <description>LOCKUP reset flag</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_LUCKUP</name>
                                    <description>no LUCKUP reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LUCKUP</name>
                                    <description>LUCKUP reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WWDTN_FLAG-->
                        <field>
                            <name>WWDTN_FLAG</name>
                            <description>WWDT reset flag</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_WWDT</name>
                                    <description>no WWDT reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WWDT</name>
                                    <description>WWDT reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--STPN_FLAG-->
                        <field>
                            <name>STPN_FLAG</name>
                            <description>STOP reset flag</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_STOP</name>
                                    <description>no STOP reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOP</name>
                                    <description>STOP reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--IWDTN_FLAG-->
                        <field>
                            <name>IWDTN_FLAG</name>
                            <description>IWDT reset flag</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_IWDT</name>
                                    <description>no IWDT reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IWDT</name>
                                    <description>IWDT reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SOFTN_FLAG-->
                        <field>
                            <name>SOFTN_FLAG</name>
                            <description>SOFT reset flag</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_SOFT</name>
                                    <description>no SOFT reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SOFT</name>
                                    <description>SOFT reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EMCN_FLAG-->
                        <field>
                            <name>EMCN_FLAG</name>
                            <description>EMC reset flag</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_EMC</name>
                                    <description>no EMC reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EMC</name>
                                    <description>EMC reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PDRN_FLAG-->
                        <field>
                            <name>PDRN_FLAG</name>
                            <description>POWER DOWN reset flag</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_PDR</name>
                                    <description>no PDR reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PDR</name>
                                    <description>PDR reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PORN_FLAG-->
                        <field>
                            <name>PORN_FLAG</name>
                            <description>POWER ON reset flag</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_POR</name>
                                    <description>no POR reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POR</name>
                                    <description>POR reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TESTN_FLAG-->
                        <field>
                            <name>TESTN_FLAG</name>
                            <description>TEST reset flag</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_TEST</name>
                                    <description>no TEST reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TEST</name>
                                    <description>TEST reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--NRSTN_FLAG-->
                        <field>
                            <name>NRSTN_FLAG</name>
                            <description>NRST reset flag</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_NRST</name>
                                    <description>no NRST reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NRST</name>
                                    <description>NRST reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--MDUN_FLAG-->
                        <field>
                            <name>MDUN_FLAG</name>
                            <description>MODE DETECT UNIT reset flag</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_MDU</name>
                                    <description>no MDU reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MDU</name>
                                    <description>MDU reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--SYSCLKSEL: system clock select Register -->
                <register>
                    <name>SYSCLKSEL</name>
                    <description>system clock select Register </description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02008300</resetValue>
                    <fields>
                        <!--SYSCLKSEL-->
                        <field>
                            <name>SYSCLKSEL</name>
                            <description>System clock select bit</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RCHF</name>
                                    <description>system clock source is RCHF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP</name>
                                    <description>system clock source is RCLP</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>system clock source is LSCLK</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL</name>
                                    <description>system clock source is PLL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--AHBPRES-->
                        <field>
                            <name>AHBPRES</name>
                            <description>AHB clk divide</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>AHB clock is not divided at 0x0xx</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV2</name>
                                    <description>AHB clock is divided by 2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV4</name>
                                    <description>AHB clock is divided by 4</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV8</name>
                                    <description>AHB clock is divided by 8</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV16</name>
                                    <description>AHB clock is divided by 16</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--APBPRES-->
                        <field>
                            <name>APBPRES</name>
                            <description>APB clk divide</description>
                            <bitRange>[18:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>APB clock is not divided at 0x0xx</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV2</name>
                                    <description>APB clock is divided by 2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV4</name>
                                    <description>APB clock is divided by 4</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV8</name>
                                    <description>AHB clock is divided by 8</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV16</name>
                                    <description>AHB clock is divided by 16</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTICKSEL-->
                        <field>
                            <name>EXTICKSEL</name>
                            <description>EXTI clk select</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>AHBCLK</name>
                                    <description>EXTI sample clk selects AHBCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>EXTI sample clk selects LSCLK</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SLP_ENEXTI-->
                        <field>
                            <name>SLP_ENEXTI</name>
                            <description>EXTI sample clk enable bit ,at sleep/deepsleep mode</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>EXTI sample clk disable </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>EXTI sample clk enable </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WKUPCLK-->
                        <field>
                            <name>WKUPCLK</name>
                            <description>wakeup clk select</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>8MHz</name>
                                    <description>running at 8MHz after wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>512KHz</name>
                                    <description>running at 512KHz after wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPM_RCLP_OFF-->
                        <field>
                            <name>LPM_RCLP_OFF</name>
                            <description>RCLP enable bit at Sleep/Stop mode (only at crystless mode)</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>Keep RCLP on at sleep/stop mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>close RCLP at sleep/stop mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
