zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--CH0RAMAD:  DMA channel0 RAM address Register-->
                <register>
                    <name>CH0RAMAD</name>
                    <description>DMA channel0 RAM address Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH0RAMAD-->
                        <field>
                            <name>CH0RAMAD</name>
                            <description>CH0 RAM address</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CH1CTRL: DMA channel1 control Register-->
                <register>
                    <name>CH1CTRL</name>
                    <description>DMA CH1 control Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH1EN-->
                        <field>
                            <name>CH1EN</name>
                            <description>channel1 enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH1 disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH1 enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH1HTIE-->
                        <field>
                            <name>CH1HTIE</name>
                            <description>channel1 half transmit interrupt enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH1 half transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH1 half transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH1FTIE-->
                        <field>
                            <name>CH1FTIE</name>
                            <description>channel1 full transmit interrupt enable bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH1 full transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH1 full transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH1SSEL-->
                        <field>
                            <name>CH1SSEL</name>
                            <description>channel1 periph source select</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ET1_CAP</name>
                                    <description>etimer1 capture data</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AES_OUT</name>
                                    <description>AES output data</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I2C_RX</name>
                                    <description>I2C receive data</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>USART0_RX</name>
                                    <description>USART0 receive data</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART3_RX</name>
                                    <description>UART3 receive data</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART0_RX</name>
                                    <description>UART0 receive data</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPI0_RX</name>
                                    <description>SPI0 receive data</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ADC_OUT</name>
                                    <description>ADC output data</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH1INC-->
                        <field>
                            <name>CH1INC</name>
                            <description>channel1 RAM address increase setting</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DECREASE</name>
                                    <description>channel1 RAM address decrease</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INCREASE</name>
                                    <description>channel1 RAM address increase</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH1PRI-->
                        <field>
                            <name>CH1PRI</name>
                            <description>channel1 priority setting</description>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>channel1's priority is low</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Medium</name>
                                    <description>channel1's priority is Medium</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>High</name>
                                    <description>channel1's priority is High</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Very High</name>
                                    <description>channel1's priority is Very High</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH1TSIZE-->
                        <field>
                            <name>CH1TSIZE</name>
                            <description>channel1 transmit size setting</description>
                            <bitRange>[28:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CH1RAMAD:  DMA channel1 RAM address Register-->
                <register>
                    <name>CH1RAMAD</name>
                    <description>DMA channel1 RAM address Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH1RAMAD-->
                        <field>
                            <name>CH1RAMAD</name>
                            <description>CH1 RAM address</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CH2CTRL: DMA channel2 control Register-->
                <register>
                    <name>CH2CTRL</name>
                    <description>DMA CH2 control Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH2EN-->
                        <field>
                            <name>CH2EN</name>
                            <description>channel2 enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH2 disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH2 enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH2HTIE-->
                        <field>
                            <name>CH2HTIE</name>
                            <description>channel2 half transmit interrupt enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH2 half transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH2 half transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH2FTIE-->
                        <field>
                            <name>CH2FTIE</name>
                            <description>channel2 full transmit interrupt enable bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH2 full transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH2 full transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH2SSEL-->
                        <field>
                            <name>CH2SSEL</name>
                            <description>channel2 periph source select</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ET3_CAP</name>
                                    <description>etimer3 capture data</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BT12_CAP</name>
                                    <description>Basetimer12 capture data</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AES_OUT</name>
                                    <description>AES output data</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I2C_TX</name>
                                    <description>I2C transmit data</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>USART0_TX</name>
                                    <description>USART0 transmit data</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART3_TX</name>
                                    <description>UART3 transmit data</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART0_TX</name>
                                    <description>UART0 transmit data</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPI0_TX</name>
                                    <description>SPI0 transmit data</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH2INC-->
                        <field>
                            <name>CH2INC</name>
                            <description>channel2 RAM address increase setting</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DECREASE</name>
                                    <description>channel2 RAM address decrease</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INCREASE</name>
                                    <description>channel2 RAM address increase</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH2PRI-->
                        <field>
                            <name>CH2PRI</name>
                            <description>channel2 priority setting</description>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>channel2's priority is low</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Medium</name>
                                    <description>channel2's priority is Medium</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>High</name>
                                    <description>channel2's priority is High</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Very High</name>
                                    <description>channel2's priority is Very High</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH2TSIZE-->
                        <field>
                            <name>CH2TSIZE</name>
                            <description>channel2 transmit size setting</description>
                            <bitRange>[28:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
