zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--CH4RAMAD:  DMA channel4 RAM address Register-->
                <register>
                    <name>CH4RAMAD</name>
                    <description>DMA channel4 RAM address Register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH4RAMAD-->
                        <field>
                            <name>CH4RAMAD</name>
                            <description>CH4 RAM address</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CH5CTRL: DMA channel5 control Register-->
                <register>
                    <name>CH5CTRL</name>
                    <description>DMA CH5 control Register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH5EN-->
                        <field>
                            <name>CH5EN</name>
                            <description>channel5 enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH5 disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH5 enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH5HTIE-->
                        <field>
                            <name>CH5HTIE</name>
                            <description>channel5 half transmit interrupt enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH5 half transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH5 half transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH5FTIE-->
                        <field>
                            <name>CH5FTIE</name>
                            <description>channel5 full transmit interrupt enable bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH5 full transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH5 full transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH5SSEL-->
                        <field>
                            <name>CH5SSEL</name>
                            <description>channel5 periph source select</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LPTIM_CAP</name>
                                    <description>LPTimer capture data</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>USART1_RX</name>
                                    <description>USART1 receive data</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>USART0_RX</name>
                                    <description>USART0 receive data</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART5_RX</name>
                                    <description>UART5 receive data</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART2_RX</name>
                                    <description>UART2 receive data</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART1_RX</name>
                                    <description>UART1 receive data</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPI2_RX</name>
                                    <description>SPI2 receive data</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPI0_RX</name>
                                    <description>SPI0 receive data</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH5INC-->
                        <field>
                            <name>CH5INC</name>
                            <description>channel5 RAM address increase setting</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DECREASE</name>
                                    <description>channel5 RAM address decrease</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INCREASE</name>
                                    <description>channel5 RAM address increase</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH5PRI-->
                        <field>
                            <name>CH5PRI</name>
                            <description>channel5 priority setting</description>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>channel5's priority is low</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Medium</name>
                                    <description>channel5's priority is Medium</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>High</name>
                                    <description>channel5's priority is High</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Very High</name>
                                    <description>channel5's priority is Very High</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH5TSIZE-->
                        <field>
                            <name>CH5TSIZE</name>
                            <description>channel5 transmit size setting</description>
                            <bitRange>[28:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CH5RAMAD:  DMA channel5 RAM address Register-->
                <register>
                    <name>CH5RAMAD</name>
                    <description>DMA channel5 RAM address Register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH5RAMAD-->
                        <field>
                            <name>CH5RAMAD</name>
                            <description>CH5 RAM address</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
