zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--CH6CTRL: DMA channel6 control Register-->
                <register>
                    <name>CH6CTRL</name>
                    <description>DMA CH6 control Register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH6EN-->
                        <field>
                            <name>CH6EN</name>
                            <description>channel6 enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH6 disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH6 enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH6HTIE-->
                        <field>
                            <name>CH6HTIE</name>
                            <description>channel6 half transmit interrupt enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH6 half transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH6 half transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH6FTIE-->
                        <field>
                            <name>CH6FTIE</name>
                            <description>channel6 full transmit interrupt enable bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH6 full transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH6 full transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH6SSEL-->
                        <field>
                            <name>CH6SSEL</name>
                            <description>channel6 periph source select</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LPTIM_CAP</name>
                                    <description>LPTimer capture data</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>USART1_TX</name>
                                    <description>USART1 transmit data</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>USART0_TX</name>
                                    <description>USART0 transmit data</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART5_TX</name>
                                    <description>UART5 transmit data</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART2_TX</name>
                                    <description>UART2 transmit data</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART1_TX</name>
                                    <description>UART1 transmit data</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPI2_TX</name>
                                    <description>SPI2 transmit data</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPI0_TX</name>
                                    <description>SPI0 transmit data</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH6INC-->
                        <field>
                            <name>CH6INC</name>
                            <description>channel6 RAM address increase setting</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DECREASE</name>
                                    <description>channel6 RAM address decrease</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INCREASE</name>
                                    <description>channel6 RAM address increase</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH6PRI-->
                        <field>
                            <name>CH6PRI</name>
                            <description>channel6 priority setting</description>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>channel6's priority is low</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Medium</name>
                                    <description>channel6's priority is Medium</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>High</name>
                                    <description>channel6's priority is High</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Very High</name>
                                    <description>channel6's priority is Very High</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH6TSIZE-->
                        <field>
                            <name>CH6TSIZE</name>
                            <description>channel6 transmit size setting</description>
                            <bitRange>[28:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
