zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--HSPICR2: control Register2-->
                <register>
                    <name>HSPICR2</name>
                    <description>control Register2</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--HSPIEN-->
                        <field>
                            <name>HSPIEN</name>
                            <description>HSPI enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>HSPI disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>HSPI enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SSNSEN-->
                        <field>
                            <name>SSNSEN</name>
                            <description>SSN controled by software at master mode</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>AUTO_OUTPUT</name>
                                    <description>SSN auto output at master mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SOFTWARE</name>
                                    <description>SSN output controled by software at master mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SSN-->
                        <field>
                            <name>SSN</name>
                            <description>SSN control bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>SSN output is low voltage</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <description>SSN output is high voltage</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXO-->
                        <field>
                            <name>TXO</name>
                            <description>TX only</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>disable tx_only mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>enable tx_only mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXO_AC-->
                        <field>
                            <name>TXO_AC</name>
                            <description>auto clear at tx_only mode enable</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>disable auto clear at tx_only mode enable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>enable auto clear at tx_only mode enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SSNM-->
                        <field>
                            <name>SSNM</name>
                            <description>SSN keep low/high after sending 8bit data at master mode</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>SSN keep low after sending 8bit data at master mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <description>SSN keep hign after sending 8bit data at master mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FLTEN-->
                        <field>
                            <name>FLTEN</name>
                            <description>filter enable for SSN/SCK/MOSI pad</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_FILTER</name>
                                    <description>no filter for pad input</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4NS</name>
                                    <description>filter 4ns for SSN/SCK/MOSI pad</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--HSPICR3: Control Register3-->
                <register>
                    <name>HSPICR3</name>
                    <description>control Register3</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SERRC-->
                        <field>
                            <name>SERRC</name>
                            <description>Slave Error Clear bit,write 1 to clear</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MERRC-->
                        <field>
                            <name>MERRC</name>
                            <description>Master Error Clear bit,write 1 to clear</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXBFC-->
                        <field>
                            <name>RXBFC</name>
                            <description>Receive Buffer Clear bit,write 1 to clear</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXBFC-->
                        <field>
                            <name>TXBFC</name>
                            <description>Transmit Buffer Clear bit,write 1 to clear</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--HSPIIE: HSPI interrupt enable Register-->
                <register>
                    <name>HSPIIE</name>
                    <description>HSPI interrupt enable Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXIE-->
                        <field>
                            <name>RXIE</name>
                            <description>receive interrupt enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIE-->
                        <field>
                            <name>TXIE</name>
                            <description>transmit interrupt enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ERRIE-->
                        <field>
                            <name>ERRIE</name>
                            <description>error interrupt enable bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
