zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--HSPIIF: HSPI interrupt flag Register-->
                <register>
                    <name>HSPIIF</name>
                    <description>HSPI interrupt flag Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <!--RXBF-->
                        <field>
                            <name>RXBF</name>
                            <description>RX Buffer Full,read RXBUF clear this bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--TXBE-->
                        <field>
                            <name>TXBE</name>
                            <description>TX Buffer Empty,write TXBUF clear this bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--BUSY-->
                        <field>
                            <name>BUSY</name>
                            <description>HSPI transmit flag</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--TXCOL-->
                        <field>
                            <name>TXCOL</name>
                            <description>TX Buffer overflow,write 1 to clear</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXCOL-->
                        <field>
                            <name>RXCOL</name>
                            <description>RX Buffer overflow,write 1 to clear</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SERR-->
                        <field>
                            <name>SERR</name>
                            <description>Slave Error</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--MERR-->
                        <field>
                            <name>MERR</name>
                            <description>Master Error</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--HSPITXBUF: HSPI TX buffer Register-->
                <register>
                    <name>HSPITXBUF</name>
                    <description>HSPI TX buffer Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXBUF-->
                        <field>
                            <name>TXBUF</name>
                            <description>TXBUF 8BIT</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--HSPIRXBUF: HSPI RX buffer Register-->
                <register>
                    <name>HSPIRXBUF</name>
                    <description>HSPI RX buffer Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXBUF-->
                        <field>
                            <name>RXBUF</name>
                            <description>RXBUF 8bit</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--SPI1-->
        <peripheral>
            <name>SPI1</name>
            <description>SPI Serial Peripheral Interface</description>
            <groupName>SPI</groupName>
            <baseAddress>0x40000840</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SPI1</name>
                <value>7</value>
            </interrupt>
            <registers>
                <!--SPICR1: Control Register1-->
                <register>
                    <name>SPICR1</name>
                    <description>SPI Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CPHA-->
                        <field>
                            <name>CPHA</name>
                            <description>Clock phase bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FIRST</name>
                                    <description>capture at First edge </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SECOND</name>
                                    <description>capture at Second edge </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CPHOL-->
                        <field>
                            <name>CPHOL</name>
                            <description>Clock polarity bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>Idle clock voltage is low</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <description>Idle clock voltage is low</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LSBF-->
                        <field>
                            <name>LSBF</name>
                            <description>Frame format bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MSB</name>
                                    <description>MSB first</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSB</name>
                                    <description>LSB first</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BAUD_RATE-->
                        <field>
                            <name>BAUD_RATE</name>
                            <description>BAUD_RATE setting</description>
                            <bitRange>[5:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>fPCLK </name>
                                    <description>only Master mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/2</name>
                                    <description>only Master mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/4</name>
                                    <description>only Master mode</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/8</name>
                                    <description>only Master mode</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/16</name>
                                    <description>only Master mode</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/32</name>
                                    <description>only Master mode</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/64</name>
                                    <description>only Master mode</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/128</name>
                                    <description>only Master mode</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WAIT-->
                        <field>
                            <name>WAIT</name>
                            <description>WAIT clock setting at master mode,(1+wait) clock</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MM-->
                        <field>
                            <name>MM</name>
                            <description>Master/Slave mode select</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SLAVE </name>
                                    <description>slave mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Master</name>
                                    <description>Master mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SSPA-->
                        <field>
                            <name>SSPA</name>
                            <description>Slave Sending Position Adjustment, Slave MISO</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_ADJUST</name>
                                    <description>NO_AHEAD at slave MISO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0.5SCK</name>
                                    <description>0.5SCK ahead at slave MISO</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--MSPA-->
                        <field>
                            <name>MSPA</name>
                            <description>Master Sampling Position Adjustment, Master MISO</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DELAY</name>
                                    <description>NO_DELAY at master MISO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0.5SCK</name>
                                    <description>0.5SCK delay at master MISO</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--SPICR2: control Register2-->
                <register>
                    <name>HSPICR2</name>
                    <description>control Register2</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--HSPIEN-->
                        <field>
                            <name>HSPIEN</name>
                            <description>HSPI enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>HSPI disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>HSPI enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SSNSEN-->
                        <field>
                            <name>SSNSEN</name>
                            <description>SSN controled by software at master mode</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>AUTO_OUTPUT</name>
                                    <description>SSN auto output at master mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SOFTWARE</name>
                                    <description>SSN output controled by software at master mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SSN-->
                        <field>
                            <name>SSN</name>
                            <description>SSN control bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>SSN output is low voltage</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <description>SSN output is high voltage</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXO-->
                        <field>
                            <name>TXO</name>
                            <description>TX only</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>disable tx_only mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>enable tx_only mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXO_AC-->
                        <field>
                            <name>TXO_AC</name>
                            <description>auto clear at tx_only mode enable</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>disable auto clear at tx_only mode enable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>enable auto clear at tx_only mode enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SSNM-->
                        <field>
                            <name>SSNM</name>
                            <description>SSN keep low/high after sending 8bit data at master mode</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>SSN keep low after sending 8bit data at master mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <description>SSN keep hign after sending 8bit data at master mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FLTEN-->
                        <field>
                            <name>FLTEN</name>
                            <description>filter enable for SSN/SCK/MOSI pad</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_FILTER</name>
                                    <description>no filter for pad input</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4NS</name>
                                    <description>filter 4ns for SSN/SCK/MOSI pad</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
