zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px12FCR-->
                        <field>
                            <name>Px12FCR</name>
                            <description>Px12 function select</description>
                            <bitRange>[25:24]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px13FCR-->
                        <field>
                            <name>Px13FCR</name>
                            <description>Px13 function select</description>
                            <bitRange>[27:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px14FCR-->
                        <field>
                            <name>Px14FCR</name>
                            <description>Px14 function select</description>
                            <bitRange>[29:28]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px15FCR-->
                        <field>
                            <name>Px15FCR</name>
                            <description>Px15 function select</description>
                            <bitRange>[31:30]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--ODR: GPIO output data register-->
                <register>
                    <name>ODR</name>
                    <description>GPIO output data register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <!--PxDO-->
                        <field>
                            <name>PxDO</name>
                            <description>PxDO output data </description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SETH:GPIO output data set register-->
                <register>
                    <name>SETH</name>
                    <description>GPIO output data set register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PxSET-->
                        <field>
                            <name>PxSET</name>
                            <description>bit set high</description>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <!--RESETL: GPIO output data reset register-->
                <register>
                    <name>RESETL</name>
                    <description>GPIO output data reset register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PxRESET-->
                        <field>
                            <name>PxRESET</name>
                            <description>GPIO output data reset register</description>
                            <bitRange>[15:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <!--IDR: Portx input data register -->
                <register>
                    <name>IDR</name>
                    <description>Portx input data register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PxDIN-->
                        <field>
                            <name>PxDIN</name>
                            <description>Portx input data </description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
