zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_EDS5-->
                        <field>
                            <name>EXTI1_EDS5</name>
                            <description>EXTI1[5] trigger edge select</description>
                            <bitRange>[27:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI1[5] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI1[5]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI1[5]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI1[5] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_EDS6-->
                        <field>
                            <name>EXTI1_EDS6</name>
                            <description>EXTI1[6] trigger edge select</description>
                            <bitRange>[29:28]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI1[6] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI1[6]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI1[6]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI1[6] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_EDS7-->
                        <field>
                            <name>EXTI1_EDS7</name>
                            <description>EXTI1[7] trigger edge select</description>
                            <bitRange>[31:30]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI1[7] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI1[7]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI1[7]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI1[7] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--EXTI2_SEL: GPIO EXTI Select 2-->
                <register>
                    <name>EXTI2_SEL</name>
                    <description>GPIO EXTI Select 2</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF0000</resetValue>
                    <fields>
                        <!--EXTI2_SEL0-->
                        <field>
                            <name>EXTI2_SEL0</name>
                            <description>EXTI2[0] input pin select</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PE2</name>
                                    <description>EXTI2[0]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NULL</name>
                                    <description>EXTI2[0]</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_SEL1-->
                        <field>
                            <name>EXTI2_SEL1</name>
                            <description>EXTI2[1] input pin select</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PE3</name>
                                    <description>EXTI2[1]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF1</name>
                                    <description>EXTI2[1] </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_SEL2-->
                        <field>
                            <name>EXTI2_SEL2</name>
                            <description>EXTI2[2] input pin select</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PE4</name>
                                    <description>EXTI2[2]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF2</name>
                                    <description>EXTI2[2] </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_SEL3-->
                        <field>
                            <name>EXTI2_SEL3</name>
                            <description>EXTI2[3] input pin select</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PE5</name>
                                    <description>EXTI2[3]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF3</name>
                                    <description>EXTI2[3] </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_SEL4-->
                        <field>
                            <name>EXTI2_SEL4</name>
                            <description>EXTI2[4] input pin select</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PE6</name>
                                    <description>EXTI2[4]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF4</name>
                                    <description>EXTI2[4] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF8</name>
                                    <description>EXTI2[4]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF8</name>
                                    <description>EXTI2[4]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_SEL5-->
                        <field>
                            <name>EXTI2_SEL5</name>
                            <description>EXTI2[5] input pin select</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PE7</name>
                                    <description>EXTI2[5]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF5</name>
                                    <description>EXTI2[5] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF9</name>
                                    <description>EXTI2[5]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF9</name>
                                    <description>EXTI2[5]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_SEL6-->
                        <field>
                            <name>EXTI2_SEL6</name>
                            <description>EXTI2[6] input pin select</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PE8</name>
                                    <description>EXTI2[6]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF6</name>
                                    <description>EXTI2[6] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF10</name>
                                    <description>EXTI2[6]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF10</name>
                                    <description>EXTI2[6]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_SEL7-->
                        <field>
                            <name>EXTI2_SEL7</name>
                            <description>EXTI2[7] input pin select</description>
                            <bitRange>[11:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PE9</name>
                                    <description>EXTI2[7]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF7</name>
                                    <description>EXTI2[7] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF11</name>
                                    <description>EXTI2[7]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF11</name>
                                    <description>EXTI2[7]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_EDS0-->
                        <field>
                            <name>EXTI2_EDS0</name>
                            <description>EXTI2[0] trigger edge select</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI2[0] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI2[0]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI2[0]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI2[0] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_EDS1-->
                        <field>
                            <name>EXTI2_EDS1</name>
                            <description>EXTI2[1] trigger edge select</description>
                            <bitRange>[19:18]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI2[1] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI2[1]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI2[1]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI2[1] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_EDS2-->
                        <field>
                            <name>EXTI2_EDS2</name>
                            <description>EXTI2[2] trigger edge select</description>
                            <bitRange>[21:20]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI2[2] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI2[2]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI2[2]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI2[2] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_EDS3-->
                        <field>
                            <name>EXTI2_EDS3</name>
                            <description>EXTI2[3] trigger edge select</description>
                            <bitRange>[23:22]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI2[3] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI2[3]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI2[3]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI2[3] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_EDS4-->
                        <field>
                            <name>EXTI2_EDS4</name>
                            <description>EXTI2[4] trigger edge select</description>
                            <bitRange>[25:24]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI2[4] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI2[4]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI2[4]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI2[4] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_EDS5-->
                        <field>
                            <name>EXTI2_EDS5</name>
                            <description>EXTI2[5] trigger edge select</description>
                            <bitRange>[27:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
