zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--HDSEL: GPIO high drive enable register-->
                <register>
                    <name>HDSEL</name>
                    <description>GPIO high drive enable register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PE2HDEN-->
                        <field>
                            <name>PE2HDEN</name>
                            <description>PE2 drive enable  </description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PG6HDEN-->
                        <field>
                            <name>PG6HDEN</name>
                            <description>PG6 drive enable  </description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ANASEL: GPIO analog select -->
                <register>
                    <name>ANASEL</name>
                    <description>GPIO output data set register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PC12ANS-->
                        <field>
                            <name>PC12ANS</name>
                            <description>PC12 analog function select</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ADC_IN1</name>
                                    <description>ADC_IN1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SEG36</name>
                                    <description>SEG36</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PC13ANS-->
                        <field>
                            <name>PC13ANS</name>
                            <description>PC13 analog function select</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ADC_IN2</name>
                                    <description>ADC_IN2</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SEG37</name>
                                    <description>SEG37</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PC14ANS-->
                        <field>
                            <name>PC14ANS</name>
                            <description>PC14 analog function select</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ACMP1_INN0</name>
                                    <description>ACMP1_INN0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SEG38</name>
                                    <description>SEG38</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PC15ANS-->
                        <field>
                            <name>PC15ANS</name>
                            <description>PC15 analog function select</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ACMP1_INP0</name>
                                    <description>ACMP1_INP0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SEG39</name>
                                    <description>SEG39</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PE3ANS-->
                        <field>
                            <name>PE3ANS</name>
                            <description>PE3 analog function select</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ACMP1_INN1</name>
                                    <description>ACMP1_INN1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SEG18</name>
                                    <description>SEG18</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PE4ANS-->
                        <field>
                            <name>PE4ANS</name>
                            <description>PE4 analog function select</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ACMP1_INP1</name>
                                    <description>ACMP1_INP1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SEG19</name>
                                    <description>SEG19</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--IODF: GPIO digital filter set register-->
                <register>
                    <name>IODF</name>
                    <description>GPIO digital filter set register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--IOAINF[0]-->
                        <field>
                            <name>IOAINF0</name>
                            <description>GPIO PA8 digital filter enable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOAINF[1]-->
                        <field>
                            <name>IOAINF1</name>
                            <description>GPIO PA9 digital filter enable</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOAINF[2]-->
                        <field>
                            <name>IOAINF2</name>
                            <description>GPIO PA10 digital filter enable</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOAINF[3]-->
                        <field>
                            <name>IOAINF3</name>
                            <description>GPIO PA11 digital filter enable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOBINF[0]-->
                        <field>
                            <name>IOBINF0</name>
                            <description>GPIO PB4 digital filter enable</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOBINF[1]-->
                        <field>
                            <name>IOBINF1</name>
                            <description>GPIO PB5 digital filter enable</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOBINF[2]-->
                        <field>
                            <name>IOBINF2</name>
                            <description>GPIO PB6 digital filter enable</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOBINF[3]-->
                        <field>
                            <name>IOBINF3</name>
                            <description>GPIO PB7 digital filter enable</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOCINF[0]-->
                        <field>
                            <name>IOCINF0</name>
                            <description>GPIO PC12 digital filter enable</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOCINF[1]-->
                        <field>
                            <name>IOCINF1</name>
                            <description>GPIO PC13 digital filter enable</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOCINF[2]-->
                        <field>
                            <name>IOCINF2</name>
                            <description>GPIO PC14 digital filter enable</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOCINF[3]-->
                        <field>
                            <name>IOCINF3</name>
                            <description>GPIO PC15 digital filter enable</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IODINF[0]-->
                        <field>
                            <name>IODINF0</name>
                            <description>GPIO PD0 digital filter enable</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IODINF[1]-->
                        <field>
                            <name>IODINF1</name>
                            <description>GPIO PD1 digital filter enable</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IODINF[2]-->
                        <field>
                            <name>IODINF2</name>
                            <description>GPIO PD2 digital filter enable</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IODINF[3]-->
                        <field>
                            <name>IODINF3</name>
                            <description>GPIO PD3 digital filter enable</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOEINF[0]-->
                        <field>
                            <name>IOEINF0</name>
                            <description>GPIO PE2 digital filter enable</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOEINF[1]-->
                        <field>
                            <name>IOEINF1</name>
                            <description>GPIO PE6 digital filter enable</description>
                            <bitRange>[17:17]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOEINF[2]-->
                        <field>
                            <name>IOEINF2</name>
                            <description>GPIO PE7 digital filter enable</description>
                            <bitRange>[18:18]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOEINF[3]-->
                        <field>
                            <name>IOEINF3</name>
                            <description>GPIO PE8 digital filter enable</description>
                            <bitRange>[19:19]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOEINF[4]-->
                        <field>
                            <name>IOEINF4</name>
                            <description>GPIO PE9 digital filter enable</description>
                            <bitRange>[20:20]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOFINF[0]-->
                        <field>
                            <name>IOFINF0</name>
                            <description>GPIO PF1 digital filter enable</description>
                            <bitRange>[21:21]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOFINF[1]-->
                        <field>
                            <name>IOFINF1</name>
                            <description>GPIO PF2 digital filter enable</description>
                            <bitRange>[22:22]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IOFINF[2]-->
                        <field>
                            <name>IOFINF2</name>
                            <description>GPIO PF3 digital filter enable</description>
                            <bitRange>[23:23]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--PINWKEN: pin wakeup enable register -->
                <register>
                    <name>PINWKEN</name>
                    <description>pin wakeup enable register </description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PINWKEN-->
                        <field>
                            <name>PINWKEN</name>
                            <description>Portx wakeup enable</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
