zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--RAMRPR0: RAM Repair Register 0-->
                <register>
                    <name>RAMRPR0</name>
                    <description>RAM Repair Register 0</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RPEN-->
                        <field>
                            <name>RPEN0</name>
                            <description>ram repair enable</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>RAM repaire disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>RAM repaire enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RAMFAD-->
                        <field>
                            <name>RAMFAD</name>
                            <description>RAM Repair Addr</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RAMRPR1: RAM Repair Register 1-->
                <register>
                    <name>RAMRPR1</name>
                    <description>RAM Repair Register 1</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RPEN-->
                        <field>
                            <name>RPEN0</name>
                            <description>ram repair enable</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>RAM repaire disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>RAM repaire enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RAMFAD-->
                        <field>
                            <name>RAMFAD</name>
                            <description>RAM Repair Addr</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RAMRPR2: RAM Repair Register 2-->
                <register>
                    <name>RAMRPR2</name>
                    <description>RAM Repair Register 2</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RPEN-->
                        <field>
                            <name>RPEN0</name>
                            <description>ram repair enable</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>RAM repaire disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>RAM repaire enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RAMFAD-->
                        <field>
                            <name>RAMFAD</name>
                            <description>RAM Repair Addr</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RAMRPR3: RAM Repair Register 3-->
                <register>
                    <name>RAMRPR3</name>
                    <description>RAM Repair Register 3</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RPEN-->
                        <field>
                            <name>RPEN0</name>
                            <description>ram repair enable</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>RAM repaire disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>RAM repaire enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RAMFAD-->
                        <field>
                            <name>RAMFAD</name>
                            <description>RAM Repair Addr</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
