zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--TON: FLICK TIME SETTING-->
                <register>
                    <name>TON</name>
                    <description>FLICK TIME SETTING</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TON-->
                        <field>
                            <name>TON</name>
                            <description>FLICK TIME SETTING</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--TOFF: FLICK TIME SETTING-->
                <register>
                    <name>TOFF</name>
                    <description>FLICK TIME SETTING</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TOFF-->
                        <field>
                            <name>TOFF</name>
                            <description>FLICK TIME SETTING</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--DISPIE: DISP IE-->
                <register>
                    <name>DISPIE</name>
                    <description>DISP IE</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DOFFIE-->
                        <field>
                            <name>DOFFIE</name>
                            <description>DISPLAY OFF IE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DONIE-->
                        <field>
                            <name>DONIE</name>
                            <description>DISPLAY ON IE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--DISPIF: DISP IF-->
                <register>
                    <name>DISPIF</name>
                    <description>DISP IF</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DOFFIF-->
                        <field>
                            <name>DOFFIF</name>
                            <description>DISP OFF IF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DONIF-->
                        <field>
                            <name>DONIF</name>
                            <description>DISP ON IF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LCDSET: LCD SETTING register-->
                <register>
                    <name>LCDSET</name>
                    <description>LCD SETTING register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LMUX-->
                        <field>
                            <name>LMUX</name>
                            <description>COM SELECT</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>4COM</name>
                                    <description>4COM</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>6COM</name>
                                    <description>6COM</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8COM</name>
                                    <description>8COM</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8COM</name>
                                    <description>8COM</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WFT-->
                        <field>
                            <name>WFT</name>
                            <description>TYPE SELECT</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TYPEA</name>
                                    <description>TAPEA</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TYPEB</name>
                                    <description>TYPEB</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--VLCD-->
                        <field>
                            <name>VLCD</name>
                            <description>VLCD SELECT</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INNER</name>
                                    <description>INNER</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTER</name>
                                    <description>OUTER</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BIASMD-->
                        <field>
                            <name>BIASMD</name>
                            <description>BIAS MODE SELECT</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1/4BIAS</name>
                                    <description>1/4BIAS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1/3BIAS</name>
                                    <description>1/3BIAS</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--LCDDRV: LCD DRIVE SETTING-->
                <register>
                    <name>LCDDRV</name>
                    <description>LCD DRIVE SETTING</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ENMODE-->
                        <field>
                            <name>ENMODE</name>
                            <description>DRIVE MODE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RBUF</name>
                                    <description>INNER RES BUFF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CAP</name>
                                    <description>OUTTER CAP</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--IC_CTRL-->
                        <field>
                            <name>IC_CTRL</name>
                            <description>BIAS CURRENT SEETING</description>
                            <bitRange>[2:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SC_CTRL-->
                        <field>
                            <name>SC_CTRL</name>
                            <description>OUTTER CAP DRIVE MODE </description>
                            <bitRange>[4:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SCFSEL-->
                        <field>
                            <name>SCFSEL</name>
                            <description>SC FREQ SELECT</description>
                            <bitRange>[7:5]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--DISPDATA0: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA0</name>
                    <description>DISPLAY DATA REGISTER </description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA1: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA1</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA2: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA2</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
