zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--DISPDATA3: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA3</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA4: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA4</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA5: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA5</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA6: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA6</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA7: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA7</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA8: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA8</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA9: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA9</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--LCDBIAS: LCD BIAS SETTING-->
                <register>
                    <name>LCDBIAS</name>
                    <description>LCD BIAS SETTING</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000000E</resetValue>
                    <fields>
                        <!--LCD BIAS SETTING-->
                        <field>
                            <name>LCDBIAS</name>
                            <description>LCDBIAS</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--COM_EN: COM ENABLE-->
                <register>
                    <name>COM_EN</name>
                    <description>COM ENABLE</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--COMEN 0-3-->
                        <field>
                            <name>COMEN</name>
                            <description>COMEN 0-3</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SEG_EN0: SEG ENABLE 0-->
                <register>
                    <name>SEG_EN0</name>
                    <description>SEG ENABLE</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SEGEN-->
                        <field>
                            <name>SEGEN</name>
                            <description>SEGEN</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SEG_EN1: SEG ENABLE 1-->
                <register>
                    <name>SEG_EN1</name>
                    <description>SEG ENABLE</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SEGEN-->
                        <field>
                            <name>SEGEN</name>
                            <description>SEGEN</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BOOSTCFG: LCD BOOST CONFIG -->
                <register>
                    <name>BOOSTCFG</name>
                    <description>BOOSTCFG</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000040</resetValue>
                    <fields>
                        <!--boost_en-->
                        <field>
                            <name>BOOSTEN</name>
                            <description>BOOSTEN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--boost_testen-->
                        <field>
                            <name>TESTEN</name>
                            <description>TESTEN</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--vlcd_cfg-->
                        <field>
                            <name>vlcd_cfg</name>
                            <description>vlcd_cfg</description>
                            <bitRange>[6:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2.5V</name>
                                    <description>2.5V</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>3.0V</name>
                                    <description>3.0V</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>3.5V</name>
                                    <description>3.5V</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4.0V</name>
                                    <description>4.0V</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4.5V</name>
                                    <description>4.5V</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>5.0V</name>
                                    <description>5.0V</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>5.5V</name>
                                    <description>5.5V</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>5.5V</name>
                                    <description>5.5V</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--vlcd_pden-->
                        <field>
                            <name>vlcd_pden</name>
                            <description>vlcd_pden</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--buffer_bypass-->
                        <field>
                            <name>buffer_bypass</name>
                            <description>buffer_bypass</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--buffer_enb-->
                        <field>
                            <name>buffer_enb</name>
                            <description>buffer_enb</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
