zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--RTCIF: RTC IF-->
                <register>
                    <name>RTCIF</name>
                    <description>RTC IF</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DATE_IF-->
                        <field>
                            <name>DATE_IF</name>
                            <description>DATE_IF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--HOUR_IF-->
                        <field>
                            <name>HOUR_IF</name>
                            <description>HOUR_IF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MIN_IF-->
                        <field>
                            <name>MIN_IF</name>
                            <description>MIN_IF</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SEC_IF-->
                        <field>
                            <name>SEC_IF</name>
                            <description>SEC_IF</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--2HZ_IF-->
                        <field>
                            <name>IF_2HZ</name>
                            <description>IF_2HZ</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--4HZ_IF-->
                        <field>
                            <name>IF_4HZ</name>
                            <description>IF_4HZ</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--8HZ_IF-->
                        <field>
                            <name>IF_8HZ</name>
                            <description>IF_8HZ</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--16HZ_IF-->
                        <field>
                            <name>IF_16HZ</name>
                            <description>IF_16HZ</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--64HZ_IF-->
                        <field>
                            <name>IF_64HZ</name>
                            <description>IF_64HZ</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--256HZ_IF-->
                        <field>
                            <name>IF_256HZ</name>
                            <description>IF_256HZ</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--1KHZ_IF-->
                        <field>
                            <name>IF_1KHZ</name>
                            <description>IF_1KHZ</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ALARM_IF-->
                        <field>
                            <name>ALARM_IF</name>
                            <description>ALARM_IF</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ADJ128_IF-->
                        <field>
                            <name>ADJ128_IF</name>
                            <description>ADJ128_IF</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--STPF0IF-->
                        <field>
                            <name>STPF0IF</name>
                            <description>RTC STAMP0 NEG edge</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--STPR0IF-->
                        <field>
                            <name>STPR0IF</name>
                            <description>RTC STAMP0 POS edge</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--STPF1IF-->
                        <field>
                            <name>STPF1IF</name>
                            <description>RTC STAMP1 NEG edge</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--STPR1IF-->
                        <field>
                            <name>STPR1IF</name>
                            <description>RTC STAMP1 POS edge</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
