zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--BCDSEC: SECOND REGISTER IN BCD-->
                <register>
                    <name>BCDSEC</name>
                    <description>SECOND REGISTER IN BCD</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BCDSEC-->
                        <field>
                            <name>BCDSEC</name>
                            <description>SECOND IN BCD</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BCDMIN: MINUTE REGISTER IN BCD-->
                <register>
                    <name>BCDMIN</name>
                    <description>MINUTE REGISTER IN BCD</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BCDMIN-->
                        <field>
                            <name>BCDMIN</name>
                            <description>MINUTE IN BCD</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BCDHOUR: HOUR REGISTER IN BCD-->
                <register>
                    <name>BCDHOUR</name>
                    <description>HOUR REGISTER IN BCD</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BCDHOUR-->
                        <field>
                            <name>BCDHOUR</name>
                            <description>HOUR IN BCD</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BCDDATE: DATE REGISTER IN BCD-->
                <register>
                    <name>BCDDATE</name>
                    <description>DATE REGISTER IN BCD</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BCDDATE-->
                        <field>
                            <name>BCDDATE</name>
                            <description>DATE IN BCD</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BCDWEEK: WEEK REGISTER IN BCD-->
                <register>
                    <name>BCDWEEK</name>
                    <description>WEEK REGISTER IN BCD</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BCDWEEK-->
                        <field>
                            <name>BCDWEEK</name>
                            <description>WEEK IN BCD</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BCDMONTH: MONTH REGISTER IN BCD-->
                <register>
                    <name>BCDMONTH</name>
                    <description>MONTH REGISTER IN BCD</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BCDMONTH-->
                        <field>
                            <name>BCDMONTH</name>
                            <description>MONTH IN BCD</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BCDYEAR: YEAR REGISTER IN BCD-->
                <register>
                    <name>BCDYEAR</name>
                    <description>YEAR REGISTER IN BCD</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BCDYEAR-->
                        <field>
                            <name>BCDYEAR</name>
                            <description>YEAR IN BCD</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ALARM: ALARM SETTING REGISTER -->
                <register>
                    <name>ALARM</name>
                    <description>ALARM SETTING REGISTER </description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ALARMSEC-->
                        <field>
                            <name>ALARMSEC</name>
                            <description>ALARM SECOND SETTING</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ALARMMIN-->
                        <field>
                            <name>ALARMMIN</name>
                            <description>ALARM MINUTE SETTING</description>
                            <bitRange>[14:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ALARMHOUR-->
                        <field>
                            <name>ALARMHOUR</name>
                            <description>ALARM HOUR SETTING</description>
                            <bitRange>[21:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--FSEL: FREQ OUTPUT SELECT-->
                <register>
                    <name>FSEL</name>
                    <description>FREQ SIGNAL OUTPUT SELECT</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--FSEL-->
                        <field>
                            <name>FSEL</name>
                            <description>FREQ SIGNAL OUTPUT SELECT</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SEC_SQUARE</name>
                                    <description>ONE SECONG SQUARE WAVE FROM PLL </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SEC_80MS</name>
                                    <description>ONE SECONG WAVE FROM PLL </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SEC_CARRY</name>
                                    <description>SECOND CARRY SIGNAL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIN_CARRY</name>
                                    <description>MINUTE CARRY SIGNAL</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HOUR_CARRY</name>
                                    <description>HOUR CARRY SIGNAL</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DATE_CARRY</name>
                                    <description>DATE CARRY SIGNAL</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ALARM_SIG</name>
                                    <description>ALARM SIGNAL</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>128SEC</name>
                                    <description>128 SECOND SQUARE SIGNAL</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV_SEC_80MS</name>
                                    <description>REVERSE SEC_80MS</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV_SEC_CARRY</name>
                                    <description>REVERSE SEC_CARRY</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV_MIN_CARRY</name>
                                    <description>REVERSE MINUTE CARRY SIGNAL</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV_HOUR_CARRY</name>
                                    <description>REVERSE HOUR CARRY SIGNAL</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV_DATE_CARRY</name>
                                    <description>REVERSE DATE CARRY SIGNAL</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV_ALARM</name>
                                    <description>REVERSE ALARM SIGNAL</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV_SEC_SQUARE</name>
                                    <description>REVERSE SEC_SQUARE SIGNAL</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INNER_SEC</name>
                                    <description>INNER SECOND SIGNAL</description>
                                    <value>15</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--ADJUST: LTBC ADJUST register -->
                <register>
                    <name>ADJUST</name>
                    <description>LTBC ADJUST register </description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ADJUST-->
                        <field>
                            <name>ADJUST</name>
                            <description>LTBC ADJUST</description>
                            <bitRange>[10:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ADSIGN:  LTBC ADJUST SIGN REGISTER-->
                <register>
                    <name>ADSIGN</name>
                    <description>LTBC ADJUST SIGN REGISTER</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ADSIGN-->
                        <field>
                            <name>ADSIGN</name>
                            <description>LTBC ADJUST SIGN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--PR1SEN: VIRTUAL TUNING register -->
                <register>
                    <name>PR1SEN</name>
                    <description>VIRTUAL TUNING register </description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PR1SEN-->
                        <field>
                            <name>PR1SEN</name>
                            <description>VIRTUAL TUNING enable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--MSECCNT: MS COUNTER register -->
                <register>
                    <name>MSECCNT</name>
                    <description>MS COUNTER register </description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--MSECCNT-->
                        <field>
                            <name>MSECCNT</name>
                            <description>MS COUNTER</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--STAMPEN: STAMP Enable register -->
                <register>
                    <name>STAMPEN</name>
                    <description>STAMP Enable register </description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--STAMP0EN-->
                        <field>
                            <name>STAMP0EN</name>
                            <description>STAMP0 enable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--STAMP1EN-->
                        <field>
                            <name>STAMP1EN</name>
                            <description>STAMP1 enable</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CLKSTAMP0R: STAMP0 STORAGE AT RISING EDGE OF PB4 -->
                <register>
                    <name>CLKSTAMP0R</name>
                    <description>STAMP0 STORAGE AT RISING EDGE register </description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SECSTP0R-->
                        <field>
                            <name>SECSTP0R</name>
                            <description>SECSTP0R</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MINSTP0R-->
                        <field>
                            <name>MINSTP0R</name>
                            <description>MINSTP0R</description>
                            <bitRange>[14:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--HRSTP0R-->
                        <field>
                            <name>HRSTP0R</name>
                            <description>HRSTP0R</description>
                            <bitRange>[21:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CALSTAMP0R: STAMP0 STORAGE AT RISING EDGE OF PB4 -->
                <register>
                    <name>CALSTAMP0R</name>
                    <description>STAMP0 STORAGE AT RISING EDGE register </description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DAYSTP0R-->
                        <field>
                            <name>DAYSTP0R</name>
                            <description>DAYSTP0R</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--WKSTP0R-->
                        <field>
                            <name>WKSTP0R</name>
                            <description>WKSTP0R</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MONSTP0R-->
                        <field>
                            <name>MONSTP0R</name>
                            <description>MONSTP0R</description>
                            <bitRange>[20:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--YRSTP0R-->
                        <field>
                            <name>YRSTP0R</name>
                            <description>YRSTP0R</description>
                            <bitRange>[31:24]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CLKSTAMP0F: STAMP0 STORAGE AT FALLING EDGE OF PB4 -->
                <register>
                    <name>CLKSTAMP0F</name>
                    <description>STAMP0 STORAGE AT FALLING EDGE register </description>
                    <addressOffset>0x4C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SECSTP0F-->
                        <field>
                            <name>SECSTP0F</name>
                            <description>SECSTP0F</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MINSTP0F-->
                        <field>
                            <name>MINSTP0F</name>
                            <description>MINSTP0F</description>
                            <bitRange>[14:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--HRSTP0F-->
                        <field>
                            <name>HRSTP0F</name>
                            <description>HRSTP0F</description>
                            <bitRange>[21:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CALSTAMP0F: STAMP0 STORAGE AT FALLING EDGE OF PB4 -->
                <register>
                    <name>CALSTAMP0F</name>
                    <description>STAMP0 STORAGE AT FALLING EDGE register </description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DAYSTP0F-->
                        <field>
                            <name>DAYSTP0F</name>
                            <description>DAYSTP0F</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--WKSTP0F-->
                        <field>
                            <name>WKSTP0F</name>
                            <description>WKSTP0F</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MONSTP0F-->
                        <field>
                            <name>MONSTP0F</name>
                            <description>MONSTP0F</description>
                            <bitRange>[20:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--YRSTP0F-->
                        <field>
                            <name>YRSTP0F</name>
                            <description>YRSTP0F</description>
                            <bitRange>[31:24]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
