zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--CLKSTAMP1R: STAMP1 STORAGE AT RISING EDGE OF PB5 -->
                <register>
                    <name>CLKSTAMP1R</name>
                    <description>STAMP1 STORAGE AT RISING EDGE register </description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SECSTP1R-->
                        <field>
                            <name>SECSTP1R</name>
                            <description>SECSTP1R</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MINSTP1R-->
                        <field>
                            <name>MINSTP1R</name>
                            <description>MINSTP1R</description>
                            <bitRange>[14:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--HRSTP1R-->
                        <field>
                            <name>HRSTP1R</name>
                            <description>HRSTP1R</description>
                            <bitRange>[21:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CALSTAMP1R: STAMP1 STORAGE AT RISING EDGE OF PB5 -->
                <register>
                    <name>CALSTAMP1R</name>
                    <description>STAMP1 STORAGE AT RISING EDGE register </description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DAYSTP1R-->
                        <field>
                            <name>DAYSTP1R</name>
                            <description>DAYSTP1R</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--WKSTP1R-->
                        <field>
                            <name>WKSTP1R</name>
                            <description>WKSTP1R</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MONSTP1R-->
                        <field>
                            <name>MONSTP1R</name>
                            <description>MONSTP1R</description>
                            <bitRange>[20:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--YRSTP1R-->
                        <field>
                            <name>YRSTP1R</name>
                            <description>YRSTP1R</description>
                            <bitRange>[31:24]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CLKSTAMP1F: STAMP1 STORAGE AT FALLING EDGE OF PB5 -->
                <register>
                    <name>CLKSTAMP1F</name>
                    <description>STAMP1 STORAGE AT FALLING EDGE register </description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SECSTP1F-->
                        <field>
                            <name>SECSTP1F</name>
                            <description>SECSTP1F</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MINSTP1F-->
                        <field>
                            <name>MINSTP1F</name>
                            <description>MINSTP1F</description>
                            <bitRange>[14:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--HRSTP1F-->
                        <field>
                            <name>HRSTP1F</name>
                            <description>HRSTP1F</description>
                            <bitRange>[21:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CALSTAMP1F: STAMP1 STORAGE AT FALLING EDGE OF PB5 -->
                <register>
                    <name>CALSTAMP1F</name>
                    <description>STAMP1 STORAGE AT FALLING EDGE register </description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DAYSTP1F-->
                        <field>
                            <name>DAYSTP1F</name>
                            <description>DAYSTP1F</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--WKSTP1F-->
                        <field>
                            <name>WKSTP1F</name>
                            <description>WKSTP1F</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MONSTP1F-->
                        <field>
                            <name>MONSTP1F</name>
                            <description>MONSTP1F</description>
                            <bitRange>[20:16]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--YRSTP1F-->
                        <field>
                            <name>YRSTP1F</name>
                            <description>YRSTP1F</description>
                            <bitRange>[31:24]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
