zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--U7816FRC: U7816 FRAME CONTROL-->
                <register>
                    <name>U7816FRC</name>
                    <description>U7816 FRAME CONTROL</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DICONV-->
                        <field>
                            <name>DICONV</name>
                            <description>DIRECTION CONV</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LSB</name>
                                    <description>LSB FIRST</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MSB</name>
                                    <description>MSB FIRST</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RREPEN-->
                        <field>
                            <name>RREPEN</name>
                            <description>AUTO POSTBACK ERROR SIGNAL WHEN PARITY_ERR</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TREPEN-->
                        <field>
                            <name>TREPEN</name>
                            <description>AUTO POSTBACK WHEN RECEIVED ERROR SIGNAL</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--FREN-->
                        <field>
                            <name>FREN</name>
                            <description>Guard Time Length</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2ETU</name>
                                    <description>2ETU</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1ETU</name>
                                    <description>1ETU</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PAR-->
                        <field>
                            <name>PAR</name>
                            <description>PARITY MODE</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Even</name>
                                    <description>Even</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Odd</name>
                                    <description>Odd</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Always1</name>
                                    <description>Always 1</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NOT_HANDLE</name>
                                    <description>NOT_HANDLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--REP_T-->
                        <field>
                            <name>REP_T</name>
                            <description>REPEAT TIME</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1T</name>
                                    <description>1T</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>3T</name>
                                    <description>3T</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BGTEN-->
                        <field>
                            <name>BGTEN</name>
                            <description>block guard time enable</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BGT_DIS</name>
                                    <description>BGT DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BGT_EN</name>
                                    <description>BGT_EN</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ERSGD-->
                        <field>
                            <name>ERSGD</name>
                            <description>GUARDTIME LENGTH AFTER ERROR SIGNAL</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2.5ETU</name>
                                    <description>2~2.5ETU</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.5ETU</name>
                                    <description>1~1.5ETU</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ERSW-->
                        <field>
                            <name>ERSW</name>
                            <description>ERROR SIGNAL LENGTH</description>
                            <bitRange>[10:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>2ETU</name>
                                    <description>2ETU</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2ETU</name>
                                    <description>2ETU</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.5ETU</name>
                                    <description>1.5ETU</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1ETU</name>
                                    <description>1ETU</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--U7816EGT: U7816 EGT config-->
                <register>
                    <name>U7816EGT</name>
                    <description>U7816 EGT config</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXEGT-->
                        <field>
                            <name>TXEGT</name>
                            <description>TX EGT</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--U7816CLKDIV: U7816 CLK DIVIDED CONFIG-->
                <register>
                    <name>U7816CLKDIV</name>
                    <description>U7816 CLK DIVIDED CONFIG</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CLKDIV-->
                        <field>
                            <name>CLKDIV</name>
                            <description>CLK DIVIDED F7816=FAPBCLK/(CLKDIV+1)</description>
                            <bitRange>[4:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--U7816PDIV: U7816 FREQ DIVISION CONFIG-->
                <register>
                    <name>U7816PDIV</name>
                    <description>U7816 FREQ DIVISION CONFIG</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PDIV-->
                        <field>
                            <name>PDIV</name>
                            <description>Baud = F7816/(PDIV+1)</description>
                            <bitRange>[11:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--U7816RXBUF: U7816 RX BUF-->
                <register>
                    <name>U7816RXBUF</name>
                    <description>U7816 RX BUF</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXBUF-->
                        <field>
                            <name>RXBUF</name>
                            <description>RX BUF</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
