zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--RXBUFSTAx: RX BUF STATUS-->
                <register>
                    <name>RXBUFSTAx</name>
                    <description>RX BUF STATUS</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000040</resetValue>
                    <fields>
                        <!--RXFF-->
                        <field>
                            <name>RXFF</name>
                            <description>RX FULL FLAG</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>EMPTY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1BYTE</name>
                                    <description>1BYTE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RX_INTSEL-->
                        <field>
                            <name>RX_INTSEL</name>
                            <description>RX_INTSEL</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>REV_FINISH</name>
                                    <description>REV_FINISH</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RXBUF_FULL</name>
                                    <description>RXBUF_FULL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RTXCONx: RTX CONVERSE REGISTER-->
                <register>
                    <name>RTXCONx</name>
                    <description>RTX CONVERSE REGISTER</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXDFLAG-->
                        <field>
                            <name>TXDFLAG</name>
                            <description>TX REVERSE CONTROL BIT</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXDFLAG-->
                        <field>
                            <name>RXDFLAG</name>
                            <description>RX REVERSE CONTROL BIT </description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RTX7EN-->
                        <field>
                            <name>RTX7EN</name>
                            <description>RTX BIT7 CONTROL BIT </description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--UART1-->
        <peripheral derivedFrom="UART0">
            <name>UART1</name>
            <baseAddress>0x4001202C</baseAddress>
            <interrupt>
                <name>UART1</name>
                <value>10</value>
            </interrupt>
        </peripheral>
        <!--UART2-->
        <peripheral derivedFrom="UART0">
            <name>UART2</name>
            <baseAddress>0x4001204C</baseAddress>
            <interrupt>
                <name>UART2</name>
                <value>11</value>
            </interrupt>
        </peripheral>
        <!--UART3-->
        <peripheral derivedFrom="UART0">
            <name>UART3</name>
            <baseAddress>0x4001206C</baseAddress>
            <interrupt>
                <name>UART3</name>
                <value>12</value>
            </interrupt>
        </peripheral>
        <!--UART4-->
        <peripheral derivedFrom="UART0">
            <name>UART4</name>
            <baseAddress>0x4001208C</baseAddress>
            <interrupt>
                <name>UART4</name>
                <value>13</value>
            </interrupt>
        </peripheral>
        <!--UART5-->
        <peripheral derivedFrom="UART0">
            <name>UART5</name>
            <baseAddress>0x400120AC</baseAddress>
            <interrupt>
                <name>UART5</name>
                <value>14</value>
            </interrupt>
        </peripheral>
        <!--I2C-->
        <peripheral>
            <name>I2C</name>
            <description>I2C Registers</description>
            <groupName>I2C</groupName>
            <baseAddress>0x40012400</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>I2C</name>
                <value>17</value>
            </interrupt>
            <registers>
                <!--I2CCON: I2C CONTROL REGISTER-->
                <register>
                    <name>I2CCON</name>
                    <description>I2C CONTROL REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00006000</resetValue>
                    <fields>
                        <!--I2CEN-->
                        <field>
                            <name>I2CEN</name>
                            <description>I2C EN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SEN-->
                        <field>
                            <name>SEN</name>
                            <description>START SEQUENCE ENABLE</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RSEN-->
                        <field>
                            <name>RSEN</name>
                            <description>REPEAT SYART ENABLE</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PEN-->
                        <field>
                            <name>PEN</name>
                            <description>STOP SEQUENCE ENABLE</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RCEN-->
                        <field>
                            <name>RCEN</name>
                            <description>RECEIVE ENABLE</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ACKEN-->
                        <field>
                            <name>ACKEN</name>
                            <description>AUTO ACK ENABLE AT MASTER</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SDAHL-->
                        <field>
                            <name>SDAHL</name>
                            <description>SDA PULL HIGH AT I2C DISABLE</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SCLHL-->
                        <field>
                            <name>SCLHL</name>
                            <description>SCL PULL HIGH AT I2C DISABLE</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--I2CSTA: I2C STATUS-->
                <register>
                    <name>I2CSTA</name>
                    <description>I2C STATUS</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ACKDT-->
                        <field>
                            <name>ACKDT</name>
                            <description>MASTER RESPOND NONE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MRP0</name>
                                    <description>MASTER RESPOND 0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MRPN</name>
                                    <description>MASTER RESPOND NONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ACKSTAT-->
                        <field>
                            <name>ACKSTAT</name>
                            <description>ACK STATE FROM SLAVE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RACK0</name>
                                    <description>RECEIVE ACK 0 FROM SLAVE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RACKN</name>
                                    <description>RECEIVE ACK NONE FROM SLAVE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BF-->
                        <field>
                            <name>BF</name>
                            <description>BUFF FULL</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>SSPBUF EMPTY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FULL</name>
                                    <description>SSPBUF FULL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--S-->
                        <field>
                            <name>S</name>
                            <description>detect start sequence</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--STOP-->
                        <field>
                            <name>STOP</name>
                            <description>detect stop sequence</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--RW-->
                        <field>
                            <name>RW</name>
                            <description>BUSY</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--WCOL-->
                        <field>
                            <name>WCOL</name>
                            <description>write collision</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--I2CBRG: I2C BAUDRATE-->
                <register>
                    <name>I2CBRG</name>
                    <description>I2C BAUDRATE</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000013</resetValue>
                    <fields>
                        <!--BRG-->
                        <field>
                            <name>BRG</name>
                            <description>Baud = FAPBCLK/((BRG+1)MUL4)</description>
                            <bitRange>[8:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--I2CBUF: I2C BUF-->
                <register>
                    <name>I2CBUF</name>
                    <description>I2C BUF</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--I2CBUF-->
                        <field>
                            <name>I2CBUF</name>
                            <description>I2C BUF</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--I2CIR: I2C INTERRUPT REGISTER-->
                <register>
                    <name>I2CIR</name>
                    <description>I2C INTERRUPT REGISTER</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--I2CIF-->
                        <field>
                            <name>I2CIF</name>
                            <description>I2C IF,write 1 to clear</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--I2CIE-->
                        <field>
                            <name>I2CIE</name>
                            <description>I2C IE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--I2CFSM: I2C FSM-->
                <register>
                    <name>I2CFSM</name>
                    <description>I2C FSM</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--I2CFSM-->
                        <field>
                            <name>I2CFSM</name>
                            <description>I2C FSM</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IDLE</name>
                                    <description>IDLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>START1</name>
                                    <description>START1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>START2</name>
                                    <description>START2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>START_DONE</name>
                                    <description>START_DONE</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TX_STATE</name>
                                    <description>TX_STATE</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCACK</name>
                                    <description>RCACK</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OP_IDLE</name>
                                    <description>OP_IDLE</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOP1</name>
                                    <description>STOP1</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOP2</name>
                                    <description>STOP2</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOP_DONE</name>
                                    <description>STOP_DONE</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RTP_START</name>
                                    <description>RTP_START</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RX_STATE</name>
                                    <description>RX_STATE</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACT_STATE</name>
                                    <description>ACT_STATE</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOP0</name>
                                    <description>STOP0</description>
                                    <value>13</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
