zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--ANATESTSEL: ANA TEST SELECT REGISTER-->
                <register>
                    <name>ANATESTSEL</name>
                    <description>ANA TEST SELECT REGISTER</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BUF4TST_SEL-->
                        <field>
                            <name>BUF4TST_SEL</name>
                            <description>BUF FOR TEST SELECT</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>vbe1_adc</name>
                                    <description>vbe1_adc</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>vbe2_adc</name>
                                    <description>vbe2_adc</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>vbe3_adc</name>
                                    <description>vbe3_adc</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>vcmbuf_adc</name>
                                    <description>vcmbuf_adc</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>vddx</name>
                                    <description>vddx</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>lfdet_out_b</name>
                                    <description>lfdet_out_b</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>VDD50</name>
                                    <description>VDD50</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>VREF08</name>
                                    <description>VREF08</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AN1</name>
                                    <description>AN1</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AN2</name>
                                    <description>AN2</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AN3</name>
                                    <description>AN3</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AN4</name>
                                    <description>AN4</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AN5</name>
                                    <description>AN5</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AN6</name>
                                    <description>AN6</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AN7</name>
                                    <description>AN7</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AN8</name>
                                    <description>AN8</description>
                                    <value>15</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BUF4TST_BYPASS-->
                        <field>
                            <name>BUF4TST_BYPASS</name>
                            <description>BUF4TST BYPASS</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--BUF4TST_EN-->
                        <field>
                            <name>BUF4TST_EN</name>
                            <description>BUF4TST ENABLE</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
