zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
            </registers>
        </peripheral>
        <!--RAMBIST-->
        <peripheral>
            <name>RAMBIST</name>
            <description>RAMBIST REGISTERS</description>
            <groupName>RAMBIST</groupName>
            <baseAddress>0x40012C00</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--RAMBISTCON: RAMBIST CONTROL REGISTER-->
                <register>
                    <name>RAMBISTCON</name>
                    <description>RAMBIST CONTROL REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <fields>
                        <!--RAMBEN-->
                        <field>
                            <name>RAMBEN</name>
                            <description>RAMBIST ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RAMFF: RAMBIST Fault Flag REGISTER-->
                <register>
                    <name>RAMFF</name>
                    <description>RAMBIST Fault Flag REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BWEF-->
                        <field>
                            <name>BWEF</name>
                            <description>Byte Write Enable Fault</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MARCF-->
                        <field>
                            <name>MARCF</name>
                            <description>SRAM March Fault</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RETF-->
                        <field>
                            <name>RETF</name>
                            <description>SRAM Retention Fault</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DECF-->
                        <field>
                            <name>DECF</name>
                            <description>Decoder Fault</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--HAMF-->
                        <field>
                            <name>HAMF</name>
                            <description>Hammer Fault</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EOT-->
                        <field>
                            <name>EOT</name>
                            <description>End of Test</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RAM0F-->
                        <field>
                            <name>RAM0F</name>
                            <description>RAM0 Fail</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RAM1F-->
                        <field>
                            <name>RAM1F</name>
                            <description>RAM1 Fail</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RAM2F-->
                        <field>
                            <name>RAM2F</name>
                            <description>RAM2 Fail</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TDF-->
                        <field>
                            <name>TDF</name>
                            <description>Total detected fault</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--BTIMER1-->
        <peripheral>
            <name>BTIMER1</name>
            <description>BASIC TIMER1 Registers</description>
            <groupName>BTIMER</groupName>
            <baseAddress>0x40013000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x044</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>BTIMER1</name>
                <value>24</value>
            </interrupt>
            <registers>
                <!--BTxCR1: BTIMER CONTROL REGISTER 1-->
                <register>
                    <name>BTxCR1</name>
                    <description>BTIMER CONTROL REGISTER1</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <fields>
                        <!--PWM-->
                        <field>
                            <name>PWM</name>
                            <description>PWM MODE OUTPUT ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CAPONCE-->
                        <field>
                            <name>CAPONCE</name>
                            <description>CAPTURE ONCE </description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CONTINUOUS</name>
                                    <description>CONTINUOUS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ONCE</name>
                                    <description>ONCE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CAPCLR-->
                        <field>
                            <name>CAPCLR</name>
                            <description>CLEAR COUNTER AT CAPTURE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOCLR</name>
                                    <description>NOCLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CAPMOD-->
                        <field>
                            <name>CAPMOD</name>
                            <description>CAPTURE MODE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PERIOD</name>
                                    <description>PULSE PERIOD</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WIDTH</name>
                                    <description>PULSE WIDTH</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EDGESEL-->
                        <field>
                            <name>EDGESEL</name>
                            <description>EDGE SELECT</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POS</name>
                                    <description>POS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEG</name>
                                    <description>NEG</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--MODE-->
                        <field>
                            <name>MODE</name>
                            <description>MODE</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>8BIT_CNT</name>
                                    <description>8BIT_CNT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16BIT_CAP</name>
                                    <description>16BIT_CAP</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CLEN-->
                        <field>
                            <name>CLEN</name>
                            <description>CLEN</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CHEN-->
                        <field>
                            <name>CHEN</name>
                            <description>CHEN</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BTxCR2: BTIMER CONTROL REGISTER 2-->
                <register>
                    <name>BTxCR2</name>
                    <description>BTIMER CONTROL REGISTER 2</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DIRPO-->
                        <field>
                            <name>DIRPO</name>
                            <description>DIRPO</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SRCSEL-->
                        <field>
                            <name>SRCSEL</name>
                            <description>SOURCE SELECT</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--STDIR-->
                        <field>
                            <name>STDIR</name>
                            <description>STDIR</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DIREN-->
                        <field>
                            <name>DIREN</name>
                            <description>DIREN</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CNTHSEL-->
                        <field>
                            <name>CNTHSEL</name>
                            <description>CNTHSEL</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ETL</name>
                                    <description>ETL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INNERCAP</name>
                                    <description>INNERCAP</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INNERCNT</name>
                                    <description>INNERCNT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ETL</name>
                                    <description>ETL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SIG1SEL-->
                        <field>
                            <name>SIG1SEL</name>
                            <description>SIG1SEL</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CAP_GROUP2</name>
                                    <description>CAP_GROUP2</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CAP_GROUP1</name>
                                    <description>CAP_GROUP1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SIG2SEL-->
                        <field>
                            <name>SIG2SEL</name>
                            <description>SIG2SEL</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CNT_GROUP1</name>
                                    <description>CNT_GROUP1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CNT_GROUP2</name>
                                    <description>CNT_GROUP2</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
