zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--BTxCMPL: BTIME CMPL REGISTER-->
                <register>
                    <name>BTxCMPL</name>
                    <description>BTIME CMPL REGISTER</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CMPL-->
                        <field>
                            <name>CMPL</name>
                            <description>CMPL</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BTxCMPH: BTIMER CMPH REGISTER-->
                <register>
                    <name>BTxCMPH</name>
                    <description>BTIMER CMPH REGISTER</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CMPH-->
                        <field>
                            <name>CMPH</name>
                            <description>CMPH</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BTxOUTCNT: BTIMER OUTCNT REGISTER-->
                <register>
                    <name>BTxOUTCNT</name>
                    <description>BTIMER OUTCNT REGISTER</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--OUTCNT-->
                        <field>
                            <name>OUTCNT</name>
                            <description>OUTCNT</description>
                            <bitRange>[11:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BTxOCR: BTIMER OUTPUT CONTROL REGISTER-->
                <register>
                    <name>BTxOCR</name>
                    <description>BTIMER OUTPUT CONTROL REGISTER</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--OUTSEL-->
                        <field>
                            <name>OUTSEL</name>
                            <description>OUTSEL</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CMPH</name>
                                    <description>CMPH</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMPL</name>
                                    <description>CMPL</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Group1</name>
                                    <description>Group1</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Group2</name>
                                    <description>Group2</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PWM</name>
                                    <description>PWM</description>
                                    <value>4</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OUTMOD-->
                        <field>
                            <name>OUTMOD</name>
                            <description>OUTMOD</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PULSE</name>
                                    <description>PULSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV</name>
                                    <description>REV</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--OUTINV-->
                        <field>
                            <name>OUTINV</name>
                            <description>OUTINV</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--OUTCLR-->
                        <field>
                            <name>OUTCLR</name>
                            <description>OUTCLR</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
