zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
                <!--ETxIE: ETIMER IE REGISTER-->
                <register>
                    <name>ETxIE</name>
                    <description>ETIMER IE REGISTER</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--OVIE-->
                        <field>
                            <name>OVIE</name>
                            <description>OVIE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CAPIE-->
                        <field>
                            <name>CAPIE</name>
                            <description>CAPIE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMPIE-->
                        <field>
                            <name>CMPIE</name>
                            <description>CMPIE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ETxIF: ETIMER IF REGISTER-->
                <register>
                    <name>ETxIF</name>
                    <description>ETIMER IF REGISTER</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--OVIF-->
                        <field>
                            <name>OVIF</name>
                            <description>OVIF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CAPIF-->
                        <field>
                            <name>CAPIF</name>
                            <description>CAPIF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EDGESTA-->
                        <field>
                            <name>EDGESTA</name>
                            <description>EDGESTA</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMPIF-->
                        <field>
                            <name>CMPIF</name>
                            <description>CMPIF</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--ETIMER2-->
        <peripheral derivedFrom="ETIMER1">
            <name>ETIMER2</name>
            <baseAddress>0x400130B0</baseAddress>
            <interrupt>
                <name>ETIMER2</name>
                <value>27</value>
            </interrupt>
        </peripheral>
        <!--ETIMER3-->
        <peripheral derivedFrom="ETIMER1">
            <name>ETIMER3</name>
            <baseAddress>0x400130D0</baseAddress>
            <interrupt>
                <name>ETIMER3</name>
                <value>28</value>
            </interrupt>
        </peripheral>
        <!--ETIMER4-->
        <peripheral derivedFrom="ETIMER1">
            <name>ETIMER4</name>
            <baseAddress>0x400130F0</baseAddress>
            <interrupt>
                <name>ETIMER4</name>
                <value>29</value>
            </interrupt>
        </peripheral>
        <!--LPTIM-->
        <peripheral>
            <name>LPTIM</name>
            <description>LPTIM Registers</description>
            <groupName>LPTIM</groupName>
            <baseAddress>0x40013400</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x020</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>LPTIM</name>
                <value>20</value>
            </interrupt>
            <registers>
                <!--LPTCFG: LPTIMER CONFIG REGISTER-->
                <register>
                    <name>LPTCFG</name>
                    <description>LPTIMER CONFIG REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TMODE-->
                        <field>
                            <name>TMODE</name>
                            <description>TMODE</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OUT_CNT</name>
                                    <description>OUT_CNT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TRIG_CNT</name>
                                    <description>TRIG_CNT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTER_SOURCE</name>
                                    <description>OUTER_SOURCE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Timeout</name>
                                    <description>Timeout</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--MODE-->
                        <field>
                            <name>MODE</name>
                            <description>MODE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CONTINUOUS</name>
                                    <description>CONTINUOUS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ONCE</name>
                                    <description>ONCE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PWM-->
                        <field>
                            <name>PWM</name>
                            <description>PWM</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SQR</name>
                                    <description>SQR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PMW</name>
                                    <description>PMW</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--POLARITY-->
                        <field>
                            <name>POLARITY</name>
                            <description>POLARITY</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POS</name>
                                    <description>POS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEG</name>
                                    <description>NEG</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TRIGCFG-->
                        <field>
                            <name>TRIGCFG</name>
                            <description>TRIGCFG</description>
                            <bitRange>[6:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POS</name>
                                    <description>POS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEG</name>
                                    <description>NEG</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BOTH</name>
                                    <description>BOTH</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EDGESEL-->
                        <field>
                            <name>EDGESEL</name>
                            <description>EDGE SELECT</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POS</name>
                                    <description>POS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEG</name>
                                    <description>NEG</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CLKSEL-->
                        <field>
                            <name>CLKSEL</name>
                            <description>CLK SOURCE SELECT</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>LSCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP</name>
                                    <description>RCLP</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PCLK</name>
                                    <description>PCLK</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPTIN</name>
                                    <description>LPTIN</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DIVSEL-->
                        <field>
                            <name>DIVSEL</name>
                            <description>CLK DIVIDED SELECT</description>
                            <bitRange>[12:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIV1</name>
                                    <description>DIV1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV2</name>
                                    <description>DIV2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV4</name>
                                    <description>DIV4</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV8</name>
                                    <description>DIV8</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV16</name>
                                    <description>DIV16</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV32</name>
                                    <description>DIV32</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV64</name>
                                    <description>DIV64</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV128</name>
                                    <description>DIV128</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--LPTCNT: LPTIMER COUNTER REGISTER-->
                <register>
                    <name>LPTCNT</name>
                    <description>LPTIMER COUNTER REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LPTCNT-->
                        <field>
                            <name>LPTCNT</name>
                            <description>LPTCNT</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LPTCMP: LPTIMER COMPARE REGISTER -->
                <register>
                    <name>LPTCMP</name>
                    <description>LPTIMER COMPARE REGISTER </description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LPTCMP-->
                        <field>
                            <name>LPTCMP</name>
                            <description>LPTCMP</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LPTTARGET: LPTIMER TARGET REGISTER-->
                <register>
                    <name>LPTTARGET</name>
                    <description>LPTIMER TARGET REGISTER</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LPTTARGET-->
                        <field>
                            <name>LPTTARGET</name>
                            <description>LPT TARGET</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LPTIE: LPTIMER IE REGISTER-->
                <register>
                    <name>LPTIE</name>
                    <description>LPTIMER IE REGISTER</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--COMPIE-->
                        <field>
                            <name>COMPIE</name>
                            <description>COMPIE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--OVIE-->
                        <field>
                            <name>OVIE</name>
                            <description>OVIE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TRIGIE-->
                        <field>
                            <name>TRIGIE</name>
                            <description>TRIGIE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LPTIF: LPTIMER IF REGISTER-->
                <register>
                    <name>LPTIF</name>
                    <description>LPTIMER IF REGISTER</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--COMPIF-->
                        <field>
                            <name>COMPIF</name>
                            <description>COMPIF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--OVIF-->
                        <field>
                            <name>OVIF</name>
                            <description>OVIF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TRIGIF-->
                        <field>
                            <name>TRIGIF</name>
                            <description>TRIGIF</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LPTCTRL: LPTIMER CTRL REGISTER-->
                <register>
                    <name>LPTCTRL</name>
                    <description>LPTIMER CTRL REGISTER</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LPTEN-->
                        <field>
                            <name>LPTEN</name>
                            <description>LPTEN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
