zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
            </registers>
        </peripheral>
        <!--AES-->
        <peripheral>
            <name>AES</name>
            <description>AES Registers</description>
            <groupName>AES</groupName>
            <baseAddress>0x40013800</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x080</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>AES</name>
                <value>19</value>
            </interrupt>
            <registers>
                <!--AESCR: AES CONTROL REGISTER-->
                <register>
                    <name>AESCR</name>
                    <description>AES CONTROL REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESEN-->
                        <field>
                            <name>AESEN</name>
                            <description>AESEN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DATATYP-->
                        <field>
                            <name>DATATYP</name>
                            <description>DATATYP</description>
                            <bitRange>[2:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>32bit</name>
                                    <description>32bit</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16bit</name>
                                    <description>16bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8bit</name>
                                    <description>8bit</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1bit</name>
                                    <description>1bit</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--MODE-->
                        <field>
                            <name>MODE</name>
                            <description>MODE</description>
                            <bitRange>[4:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENCRYPT</name>
                                    <description>ENCRYPT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>KEY_EXPANSION</name>
                                    <description>KEY_EXPANSION</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DECRYPT</name>
                                    <description>DECRYPT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>KEYEXP_DEC</name>
                                    <description>KEY_EXPANSION + DECRYPT</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CHMOD-->
                        <field>
                            <name>CHMOD</name>
                            <description>CHMOD</description>
                            <bitRange>[6:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ECB</name>
                                    <description>ECB</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CBC</name>
                                    <description>CBC</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTR</name>
                                    <description>CTR</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MultH</name>
                                    <description>MultH</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CCFC-->
                        <field>
                            <name>CCFC</name>
                            <description>CCF Clear</description>
                            <bitRange>[7:7]</bitRange>
                            <access>write-only</access>
                        </field>
                        <!--ERRC-->
                        <field>
                            <name>ERRC</name>
                            <description>ERR Clear</description>
                            <bitRange>[8:8]</bitRange>
                            <access>write-only</access>
                        </field>
                        <!--CCFIE-->
                        <field>
                            <name>CCFIE</name>
                            <description>CCFIE</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ERRIE-->
                        <field>
                            <name>ERRIE</name>
                            <description>ERRIE</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DMAIEN-->
                        <field>
                            <name>DMAIEN</name>
                            <description>DMAIEN</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--DMAOEN-->
                        <field>
                            <name>DMAOEN</name>
                            <description>DMAOEN</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--KEYLEN-->
                        <field>
                            <name>KEYLEN</name>
                            <description>KEYLEN</description>
                            <bitRange>[14:13]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>128bit</name>
                                    <description>128bit</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>192bit</name>
                                    <description>192bit</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>256bit</name>
                                    <description>256bit</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV</name>
                                    <description>REV</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--AESIF: AES IF REGISTER-->
                <register>
                    <name>AESIF</name>
                    <description>AES IF REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CCF-->
                        <field>
                            <name>CCF</name>
                            <description>CCF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RDERR-->
                        <field>
                            <name>RDERR</name>
                            <description>RDERR</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--WRERR-->
                        <field>
                            <name>WRERR</name>
                            <description>WRERR</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESDIN: AES DATA INPUT REGISTER -->
                <register>
                    <name>AESDIN</name>
                    <description>AES DATA INPUT REGISTER </description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESDIN-->
                        <field>
                            <name>AESDIN</name>
                            <description>AESDIN</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESDOUT: AES DATA OUTPUT REGISTER-->
                <register>
                    <name>AESDOUT</name>
                    <description>AES DATA OUTPUT REGISTER</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESDOUT-->
                        <field>
                            <name>AESDOUT</name>
                            <description>AESDOUT</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESKEY0: AES KEY0 REGISTER-->
                <register>
                    <name>AESKEY0</name>
                    <description>AES KEY0 REGISTER</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESKEY-->
                        <field>
                            <name>AESKEY</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESKEY1: AES KEY1 REGISTER-->
                <register>
                    <name>AESKEY1</name>
                    <description>AES KEY1 REGISTER</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESKEY-->
                        <field>
                            <name>AESKEY</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESKEY2: AES KEY2 REGISTER-->
                <register>
                    <name>AESKEY2</name>
                    <description>AES KEY2 REGISTER</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESKEY-->
                        <field>
                            <name>AESKEY</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
