zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以下/debugger/FMSH/FM33A0xx.SVD
            </registers>
        </peripheral>
        <!--TRNG-->
        <peripheral>
            <name>TRNG</name>
            <description>TRNG Registers</description>
            <groupName>TRHG</groupName>
            <baseAddress>0x40013C04</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x020</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TRNG</name>
                <value>22</value>
            </interrupt>
            <registers>
                <!--RNGOUT: TRNG OUTPUT REGISTER-->
                <register>
                    <name>RNGOUT</name>
                    <description>TRNG OUTPUT REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RNGOUT-->
                        <field>
                            <name>RNGOUT</name>
                            <description>RNGOUT</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RNGIE: TRNG IE REGISTER-->
                <register>
                    <name>RNGIE</name>
                    <description>TRNG IE REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EOGIE-->
                        <field>
                            <name>EOGIE</name>
                            <description>EOGIE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RNFIE-->
                        <field>
                            <name>RNFIE</name>
                            <description>RNFIE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CRCDIE-->
                        <field>
                            <name>CRCDIE</name>
                            <description>CRCDIE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RNGIF: TRNG IF REGISTER -->
                <register>
                    <name>RNGIF</name>
                    <description>TRNG IF REGISTER </description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EOG-->
                        <field>
                            <name>EOG</name>
                            <description>EOG</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RNF-->
                        <field>
                            <name>RNF</name>
                            <description>RNF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RBUSY-->
                        <field>
                            <name>RBUSY</name>
                            <description>RBUSY</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CRCD-->
                        <field>
                            <name>CRCD</name>
                            <description>CRCD</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CRCIN: CRC INPUT REGISTER-->
                <register>
                    <name>CRCIN</name>
                    <description>CRC INPUT REGISTER</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CRCIN-->
                        <field>
                            <name>CRCIN</name>
                            <description>CRCIN</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CRCCON: CRC CONTROL REGISTER-->
                <register>
                    <name>CRCCON</name>
                    <description>CRC CONTROL REGISTER</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CRCEN-->
                        <field>
                            <name>CRCEN</name>
                            <description>CRCEN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
